import numpy as np
import pandas as pd


def task1():
    print("Завдання 1")
    # Створення масиву стандартним способом
    a = np.array([[2, 3, 4], [1, 2, 3], [7, 8, 9]])
    print(
        f"\nРезультат створення двовимірного масиву за допомогою списків: \n{a}\n")

    '''
    Створення масивів, елементи якої представлені
    в різних типах
    '''
    b1 = np.array([2, 2, 2], dtype="bool")
    b2 = np.array([2, 2, 2], dtype="int")
    b3 = np.array([2, 2, 2], dtype="float")
    b4 = np.array([2, 2, 2], dtype="uint")
    print(
        f"Bool array - {b1}; int array - {b2}, float array - {b3}, uint array - {b4}\n")

    c = np.ones(5)
    print(f"Масив, який складається з п'яти одиниць - {c}\n")

    c1 = np.zeros((4, 3))
    print(f"Двовимірний масив, який складається з чотирьох нулів -\n{c1}\n")

    d = np.arange(5, 10, 0.5)
    print(f"Генерування масиву від 5 до 10 з кроком 0.5 - {d}\n")

    e = np.linspace(2, 7, 11)
    print(
        f"Генерування масиву розділений на 11 елементів рівномірно від 2 до 7 - {e}\n")

    f = np.random.random([2, 2])
    print(
        f"Двовимірний масив із псевдорандомними числами в інтервалі [0, 1] -\n{f}\n")

    g = np.random.rand(3, 2, 2)

    print(
        f"Трьохвимірний масив із випадковими значеннями розміром 5x2x2 -\n{g}")


def task2():
    print("Завдання 2\n")
    a = np.array([1, 2, 3, 4, 5, 6])
    print(f"Маємо одновимірний масив a - {a}\n")

    print(f"Звертаємось до елементу з індексом '1' - {a[1]} ")
    print(f"Звертаємось до останнього елементу з індексом '-1' - {a[-1]} ")
    print(
        f"Звертаємось до елементів з індексами в інтервалі [1:4) - {a[1:4]} ")
    print(
        f"Звертаємось до елементів з індексами в інтервалі [1:4) з кроком 2 - \n{a[1:4:2]}\n")

    b = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
    print(f"Маємо двовимірний масив b - {b}\n")
    print(f"Звертаємось до одновимірного масиву з індексом '1' - {b[1]} ")
    print(
        f"Звертаємось до останнього одновимірного елементу з індексом '-1' - {b[-1]} ")
    print(
        f"Звертаємось до масивів з індексами в інтервалі [1:4) - \n{b[0:2]} ")
    print(
        f"Звертаємось до елементів з індексами в інтервалі [1:4) з кроком 2 - \n{b[0:3:2]} ")
    print(f"Виводимо останній елемент з масиву індексу '1' - {b[1, -1]}")
    print(
        f"Виводимо масиви, елементи котрих є [5, 6] та [8, 9] - \n{b[1:3, 0:2]}\n")


def task3():
    print("Завдання 3\n")
    a = np.arange(6)
    b = np.arange(2, 8)

    print(f"Сума двох масивів - {np.add(a, b)}")
    print(f"Різниця двох масивів - {np.subtract(a, b)}")
    print(f"Множення двох масивів - {np.multiply(a, b)}")
    print(f"Ділення двох масивів - {np.divide(a, b)}")
    print(f"Зміна знаку елементів масиву - {np.negative(a)}")
    print(
        f"Сума двовимірного масиву на одновимірний \n{np.arange(0, 9).reshape(3, 3) + np.arange(0, 3)}")

    print(f"Використання функції reduce - ({np.subtract.reduce(-a)})")
    print(f"Використання функції accumulate - ({np.add.accumulate(a)})")
    print(f"Використання функції outer - \n{np.multiply.outer(a, a)}\n")


def task4():
    data = pd.read_csv("iris.csv")
    petal = np.array(data["petal_width"])

    print(f"Мінімальне значення - {np.min(petal)}")
    print(f"Максимальне значення - {np.max(petal)}")
    print(f"Середнє значення - {np.mean(petal)}")
    print(f"Дисперсія - {np.var(petal)}")
    print(f"Медіана - {np.median(petal)}")
    print(f"50 перцентиль - {np.percentile(petal, 50)}")
    print(f"75 перцентиль - {np.percentile(petal, 75)}")


if __name__ == "__main__":

    # task1()
    # print("-------------------------------")
    # task2()
    # print("-------------------------------")
    task3()
    # print("-------------------------------")
    # task4()
    # b = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
    # print(b[:, ::2])
